#include<iostream>;
#include<cmath>;
#include<windows.h>;
using namespace std;
int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    int p;
    cout << "Меню:\n1)Ватикан - 100\n2)Лихтенштейн - 200\n3)Андорра - 500\n4)Бельгия - 30000\n5)Дания - 43000\n6)Латвия - 65000\n7)Ирландия - 70000\n8)Австрия - 83000\n9)Болгария - 110000\n10)Греция - 132000\n11)Великобритания - 244000\n12)Италия - 301000\n13)Испания - 504000\n";
    cout << "Введите площадь: ";
    cin >> p;
    cout << "\nПлощадь не менее " << p << " Имеют следующие острова: \n";
    switch (p)
    {
    case 100:
    {
        cout << "1)Ватикан - 100\n";
    }
    case 200:
    {
        cout << "2)Лихтенштейн - 200\n";
    }
    case 500:
    {
        cout << "3)Андорра - 500\n";
    }
    case 30000:
    {
        cout << "4)Бельгия - 30000\n";
    }
    case 43000:
    {
        cout << "5)Дания - 43000\n";
    }
    case 65000:
    {
        cout << "6)Латвия - 65000\n";
    }
    case 70000:
    {
        cout << "7)Ирландия - 70000\n";
    }
    case 83000:
    {
        cout << "8)Австрия - 83000\n";
    }
    case 110000:
    {
        cout << "9)Болгария - 110000\n";
    }
    case 132000:
    {
        cout << "10)Греция - 132000\n";
    }
    case 244000:
    {
        cout << "11)Великобритания - 244000\n";
    }
    case 301000:
    {
        cout << "12)Италия - 301000\n";
    }
    case 504000:
    {
        cout << "13)Испания - 504000\n";
    }
   break;
    default:
    {
        cout << "ошибка";
    }
    break;
    }
    system("pause");
    return 0;
}